Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_+99 Reinforced Wooden Stick.tmx
Source language: en
Languages: es_419

source: watches,
es_419: relojes,

source: wh-what’s that?!
es_419: ¡¿Q-qué es eso?!

source: like I mentioned earlier, my soul now resides within your weapon.
es_419: Como dije antes, mi alma ahora reside dentro de su arma.

source: ...that this is nothing new...
es_419: … en que esto no es nada nuevo…

source: but there’s someone who would like to meet with ms. han.
es_419: Pero hay alguien que quiere ver a la señorita Han.

source: ...a pro?
es_419: … una pro?

source: a{j}a{j}a{j}a{j}a{j}a{j}h
es_419: AAAAAAAAH

source: danger?
es_419: ¿Peligro?

source: look over there.
es_419: Mira allí.

source: a sense of relatability?
es_419: ¿Me identifiqué con ella?

source: I’ve made my decision!
es_419: ¡Ya tomé mi decisión!

source: the reason the chrono life servers went down was because of "that guy".
es_419: Los servidores de Chrono Life se cayeron por culpa de “ese tipo”.

source: everyone says...
es_419: Todos coinciden…

source: even at +10, the chance of success for the next reinforcement is less than 5%.
es_419: Incluso para pasar de +10, las probabilidades de éxito son de menos del 5 %.

source: twin-headed dragon urus
es_419: URUS EL DRAGÓN DE DOS CABEZAS

source: this is what online games are all about!
es_419: ¡De eso se tratan los juegos en línea!

source: hahahahahaha hahahahahaha!
es_419: ¡Ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja!

source: don’t bother with him.
es_419: Ni te molestes.

source: because of you?!
es_419: por tu culpa?!

source: supreme commander, hawkeye’s stream
es_419: Stream de Hawkeye, comandante supremo

source: ...her character deleted?
es_419: … ¿le borraron el personaje?

source: hahahaha{j}Ha
es_419: ¡Ja, ja, ja, ja, ja!

source: that fake act has a chokehold on the entire nation.
es_419: Esa farsa tiene cautivada a toda la nación.

source: falling dragon strike
es_419: DRAGÓN DESCENDENTE

source: ha{j}ha{j}ha{j}ha{j}ha{j}ha{j}ha{j}ha
es_419: Ja ja ja ja ja ja ja ja

source: I...
es_419: Yo…

source: p-please forgive me, boss!
es_419: ¡P-por favor, perdóneme, jefe!

source: you little wench! what the hell is wrong with you?!
es_419: ¡Maldita malcriada! ¡¿Qué rayos te pasa?!

source: 38{j}hahaha
es_419: Ja, ja, ja

source: isn’t it?
es_419: ¿no?

source: raaaaah
es_419: GRAAAAAA

source: beautiful evening, isn’t it?
es_419: Es una hermosa noche, ¿no?

source: you’re wearing nothing but a cape and underwear!
es_419: ¡Solo traes puesta una capa y calzoncillos!

source: o-of course not.
es_419: C-claro que no.

source: all of my attacks up until now...
es_419: Todos mis ataques hasta ahora…

source: sarang’s fame had faded, yet she still didn’t have the choice to quit her singing career.
es_419: Sarang había perdido su fama, pero, aun así, no le permitían abandonar su carrera musical.

source: ...missile!
es_419: … de fuego!

source: episode 18. one love (2)
es_419: Episodio 18: Un amor (2)

source: so I suggest you do your best to dodge it.
es_419: Así que te sugiero que hagas lo posible por esquivarlo.

source: but I did spend a pretty penny on this game.
es_419: Pero sí gasté un buen dinero en este juego.

source: wh-what the hell is that?
es_419: ¡¿Q-qué rayos es eso?!

source: this player has killed over 800,000 users in just one day.
es_419: Este jugador ha matado a 800 000 usuarios en un solo día.

source: the hallasan guild, was it?
es_419: ¿El Gremio de Hallasan… dices que era?

source: they may be summoned by their owner at any time.
es_419: Pueden ser invocadas por su dueño en cualquier momento.

source: what do you think you’re doing?
es_419: ¿Qué cree que está haciendo?

source: did you steal it back from them?
es_419: ¿Se las arrebataste?

source: how is it that you’re constantly cranking out hit after hit?
es_419: ¿Cómo es que produces constantemente un éxito tras otro?

source: this place isn’t known to other people.
es_419: Nadie más conoce este lugar.

source: if anything, I’m surprised people didn’t realize it was you sooner!
es_419: ¡Me sorprende que la gente no se haya dado cuenta antes de que eras tú!

source: ...you all...
es_419: … a todos…

source: The ‘Law of the Jungle’ has no mercy for the weak in the virtual gaming world of “Chrono Life”, but that doesn’t apply to Jiwoo anymore.
es_419: La “ley de la selva” no les da piedad a los débiles en el mundo virtual de Chrono Life, pero eso ya no corre para Jiwoo.

source: do you really think a mere human like yourself could accomplish such a thing?
es_419: ¿En verdad crees que un simple mortal como tú podría lograr algo así?

source: frown
es_419: TRISTE

source: now, now. calm down.
es_419: Bueno, bueno, calma.

source: all of the energy he stole is going back to their owners!
es_419: ¡Toda la energía que robó está volviendo a sus dueños!

source: only you can see and hear me, sir.
es_419: Solamente usted puede verme y oírme, señor.

source: you will be given one choice to make.
es_419: Se te dará una elección.

source: there’s no way the servers would go down because of that.
es_419: Los servidores no pueden haberse caído por eso.

source: I’ve never heard of that before.
es_419: Nunca había oído sobre eso.

source: what’s with this goofy-looking character?
es_419: ¿Qué le pasa a este personaje tan peculiar?

source: uhh, never mind.
es_419: Eh, mejor no.

source: I barely have enough to afford going to the arcade nowadays.
es_419: Apenas me alcanza para ir al salón de realidad virtual.

source: let’s get you something even more delicious.
es_419: Buscaremos algo aún más delicioso.

source: secretly... op?
es_419: ¿Imagen… SP?

source: sorry about that.
es_419: Perdón.

source: this game is the one.
es_419: Este es el juego.

source: ...we will be confiscating the +99 reinforced wooden stick.
es_419: … confiscaremos el palo de madera +99.

source: by the way, it seems like you’re not associated with any guild...
es_419: Por cierto, parece que no estás en ningún gremio…

source: and who are you?
es_419: ¿Y tú quién eres?

source: b{j}l{j}e{j}e{j}e{j}e{j}c{j}h
es_419: BLUUUUAJ

source: the top game in the world [chrono life]
es_419: El mejor juego del mundo [Chrono Life]

source: he’s really playing the game his way!
es_419: ¡En verdad está jugando a su manera!

source: even I’m getting emotional just thinking about it!
es_419: ¡Hasta yo me emociono de solo pensarlo!

source: who is this person?
es_419: ¿Quién es él?

source: and it seems like she had her eyes closed while you were saving her.
es_419: Me parece que ella tenía los ojos cerrados cuando la salvó.

source: a schedule like this would have even been hard for the average adult to handle.
es_419: Cumplir con una agenda como esa habría sido difícil incluso para un adulto.

source: how can we stop him from making these trades?
es_419: ¿Cómo evitamos que haga esas transacciones?

source: in-app purchases.
es_419: Hizo compras por la app.

source: I’ve got a car,
es_419: Tengo un auto,

source: you damn roach mom.
es_419: maldita cucaracha mamá.

source: never.
es_419: Jamás.

source: th-the enemy is standing!
es_419: ¡E-el enemigo se puso de pie!

source: we’re finally here!
es_419: ¡Por fin llegamos!

source: episode 14. character deleted (2){j}one love
es_419: {j}Un amor

source: after feeling the immense pressure put on her, sarang finally fell apart.
es_419: Debido a la tremenda presión que ejercían sobre ella, Sarang finalmente se desmoronó.

source: episode 19. one love (3)
es_419: Episodio 19: Un amor (3)

source: whoosh!
es_419: ¡FUUUSH!

source: but if the reinforcement fails, your item gets destroyed.
es_419: Pero, si fallas en mejorarlo, tu objeto se destruye.

source: req 1. become master level req 2. have over 14,000 con req 3. after reaching the requirements above, take a set amount of damage.
es_419: REQ 1. Llegar al nivel maestro REQ 2. Tener más de 14 000 en CON REQ 3. Después de cumplir los requisitos anteriores, recibir una cantidad determinada de daño.

source: there’s got to be...
es_419: Tiene que haber…

source: y-yes, boss!
es_419: ¡S-sí,ama!

source: the capital of the first kingdom...
es_419: La capital del primer reino…

source: ...and wooden stick?
es_419: … y tiene un palo de madera?

source: did you not hear that just now?
es_419: ¿No escuchaste?

source: 10 million gold
es_419: 10 millones en oro

source: why wouldn’t they be?
es_419: ¿Y por qué no lo estarían?

source: I’ve wanted to apologize to you this whole time.
es_419: Todo este tiempo he querido pedirte perdón.

source: cross line guild
es_419: Gremio Cruzada Roja

source: [a million strikes]
es_419: [Un millón de golpes]

source: he stole other users’ energy by killing and absorbing them!
es_419: ¡Les quitó la energía a otros usuarios al matarlos y absorberlos!

source: one versus three million.
es_419: Uno contra tres millones.

source: even if I were to summon the entire urus legion, it would still be inevitable defeat.
es_419: Aunque yo convocara a toda la legión de Urus, sería inevitable la derrota.

source: what kind of boss monster runs around acting like a regular human?
es_419: ¿Qué clase de jefe va por ahí actuando como un humano?

source: your level has decreased.
es_419: Has bajado de nivel.

source: bonk
es_419: TONC

source: ...absolutely scrumptious.
es_419: … absolutamente deliciosa.

source: that crest on their armor...
es_419: Esa insignia en la armadura…

source: how about we start things off with a good beating?
es_419: ¿Qué tal si empezamos con una buena paliza?

source: foolish mutts. you don’t even recognize your owner?
es_419: Perros tontos. ¿Ya ni reconocen a su dueño?

source: it’s been so long since I visited. your base is a total mess.
es_419: Hace rato que no venía de visita. La base está hecha un desastre.

source: I used to come here all the time when I was broke.
es_419: Venía aquí todo el tiempo cuando no tenía dinero.

source: honestly, I’m just doing him a favor by hanging out with him.
es_419: Sinceramente, le hago un favor quedándome con él.

source: continue your report.
es_419: Continúa con el informe.

source: if I had to rank myself in terms of game tiers...
es_419: Si tuviera que clasificarme en niveles de juego…

source: a bugged item?! what do you mean?!
es_419: ¡¿Un error?! ¡¿Qué quieres decir con eso?!

source: thank you for coming!
es_419: ¡Gracias por venir!

source: I was going to keep my powers a secret and live a quiet life.
es_419: Iba a mantener mis poderes en secreto y a vivir una vida tranquila.

source: we need to get going for your next gig.
es_419: Debemos salir pronto para el evento de hoy.

source: more importantly, why did you have them on you, undies?
es_419: Pero lo importante es… ¿por qué las tenías tú, Calzón?

source: eeeeeek!
es_419: ¡Aaaaah!

source: hello?
es_419: ¿Diga?

source: it wasn’t just a defeat.
es_419: No fue una simple derrota.

source: oh, hello!
es_419: ¡Ah, hola!

source: push
es_419: EMPUJA

source: shall we end this?
es_419: ¿Terminamos con esto?

source: I suggest you take a look at this screen, sir.
es_419: Le sugiero que eche un vistazo a esta pantalla, señor.

source: I’m always down for a freebie!
es_419: ¡Me encantan los regalos!

source: ...no matter how many times I look back on this moment, I just don’t understand.
es_419: … por más veces que recuerde este momento, jamás lo entenderé.

source: is this the furry guy?!
es_419: ¡¿Este es el peludito?!

source: he’s a world-famous billionaire, as well as the creator of mycrosoft.
es_419: Es un famoso multimillonario, además de ser el creador de Mycrosoft.

source: calling all hallasan guild members!
es_419: Todos los miembros del Gremio de Hallasan…

source: the soul of the [wand] has entered your body.
es_419: El alma de [la varita] ha entrado en tu cuerpo.

source: l-look over there!
es_419: ¡M-miren allí!

source: m-mr. wang!
es_419: ¡S-señor Wang!

source: I reinforced that item myself!
es_419: ¡Yo mismo mejoré ese objeto!

source: you’ve already got enough money!
es_419: ¡Ya tienen dinero suficiente!

source: I can’t believe we let this loser into our party!
es_419: ¡No puedo creer que hayamos aceptado a esta inútil en nuestro grupo!

source: why’d you even bother asking, then?
es_419: Entonces, ¿para qué me preguntas?

source: that’s when I finish work. so you better log in then too!
es_419: A esa hora termino de trabajar. ¡Más te vale estar conectado!

source: first in most registered users.
es_419: Primero en cantidad de usuarios registrados.

source: seriously? that’s way too op.
es_419: ¿En serio? Eso es muy SP.

source: this is strange...
es_419: Qué extraño…

source: STUDIO 389{j}story: hongsil, art: jiperi, producer: du-yeop, staff: jaehyeon lee, rokri, mimanga, kongsna, wallabi
es_419: STUDIO 389

source: ...even to this day, she becomes anxious once she takes off her glasses.
es_419: … hasta el día de hoy, sufre de ansiedad cuando tiene que quitárselos.

source: jeez, that’s pretty bad.
es_419: Cielos, eso es muy malo.

source: urus’ legion
es_419: La legión de Urus

source: you’re a lot squishier now.
es_419: Ahora eres mucho más blandito.

source: that...
es_419: Ese…

source: there was no announcement about this!
es_419: ¡No hicieron ningún anuncio!

source: I thought you were a mob boss!
es_419: ¡Pensé que eras un jefe mafioso!

source: *boost: when an experienced player helps a lower level player by joining their party and killing boss mobs for them.
es_419: *Subir el nivel: cuando un jugador experimentado se une al grupo de un jugador de nivel inferior y mata a jefes por él para ayudarlo.

source: w-wait. hold on!
es_419: E-espere. ¡Un momento!

source: get revenge!
es_419: ¡Vengarnos!

source: funny?
es_419: ¿Gracioso?

source: pivot
es_419: GIRA

source: really, now?
es_419: ¿En serio?

source: episode 17. one love (1)
es_419: Episodio 17: Un amor (1)

source: could you please hold?
es_419: ¿Podría aguardar un momento?

source: now I’m annoyed because you remind me of that nasty roach.
es_419: Ya me hiciste enojar, porque me recuerdas a esa apestosa cucaracha.

source: artㆍJIPERY{j}story: hongsil, art: jiperi, producer: du-yeop, staff: jaehyeon lee, rokri, mimanga, kongsna, wallabi
es_419: Arte: Jipery

source: ...with those attacks.
es_419: Con esos ataques.

source: so you’re a boss monster?
es_419: ¿Así que tú eres un jefe?

source: stumble
es_419: SE TAMBALEA

source: exploration?
es_419: ¿Exploración?

source: just a moment ago, I could’ve sworn I wa--
es_419: Podría jurar que hace un momento…

source: but it looks like I can use it one last time.
es_419: Pero parece que puedo usarlo una última vez.

source: oh, umm...
es_419: Eh, emm…

source: do you know what I went through...
es_419: ¡¿Tienes idea de lo que pasé…

source: I know what to do...
es_419: Ya sé qué hacer…

source: secretly op?
es_419: ¿Lo de ser SP?

source: I just concluded that I did it...
es_419: Llegué a la conclusión de que lo hice…

source: episode 9. heavy spenders (3)
es_419: Episodio 9: Grandes consumidores (3)

source: I think I saw him delay his attack just now!
es_419: ¡Creo que lo vi retrasar su ataque!

source: me? almost at max level?
es_419: ¿Yo? ¿Casi en el nivel máximo?

source: ...it began to rain...
es_419: … comenzaron a llover…

source: hahaha.
es_419: Ja, ja, ja.

source: just give me one more chance!
es_419: ¡Deme otra oportunidad!

source: it only makes sense.
es_419: Tiene sentido.

source: I guess you really are a god, huh?
es_419: Supongo que sí eres un dios, ¿no?

source: then, there’s the exp that came from slaying urus, chrono life’s strongest boss monster.
es_419: Luego, obtuvo experiencia por matar a Urus, el enemigo más poderoso de Chrono Life.

source: hmm?
es_419: ¿Mmm?

source: is this already all over?
es_419: ¿Ya terminó todo?

source: stare
es_419: MIRA

source: don’t scare me like that.
es_419: No me asusten así.

source: the first being urakan.
es_419: El primero es Urakan.

source: your weapon’s over there, sweetie.
es_419: Tu arma está allí, querida.

source: isn’t it obvious?
es_419: ¿No es obvio?

source: now his character is bound to fail for the rest of the game.
es_419: Ahora su personaje está condenado a fracasar el resto del juego.

source: are you trying to ruin your career?!
es_419: ¡¿Quieres arruinar tu carrera?!

source: do you know how hard it was for me to make up another excuse?
es_419: ¿Saben lo difícil que fue inventar otra excusa?

source: ahh!
es_419: ¡Aah!

source: initiating iris scan.
es_419: Iniciando escaneo de retina.

source: I knew I was right about you. you were "that man".
es_419: Sabía que no me equivocaba contigo. Eras “ese tipo”.

source: and that choice will be to select one of the ascended weapons...
es_419: Y esa elección será seleccionar una de las armas ascendidas…

source: uhh...{j}I think?
es_419: Ehh…{j}¿Puede ser?

source: found her.
es_419: La encontramos.

source: all right.
es_419: Muy bien.

source: you’re the one who moved in next door.
es_419: Tú te mudaste al apartamento de al lado.

source: "were"?
es_419: ¿”Iban”?

source: you and that undies man.
es_419: tú y ese Calzón.

source: ...lied...
es_419: … me mintió…

source: 14 straight weeks of winning first place. that’s amazing!
es_419: Ya 13 semanas seguidas en el primer puesto. ¡Es fabuloso!

source: ...this one, sir.
es_419: … esta, señor.

source: who could have possibly survived that explosion?
es_419: ¿Quién podría haber sobrevivido a esa explosión?

source: you're the first one to crack this after "that person" did.
es_419: Eres el primero que raja esto después de aquella “otra persona”.

source: well, enough funny stuff. it’s time for you to get a beating.
es_419: Bueno, basta de eso. Es hora de que te dé una paliza.

source: things are real interesting here!
es_419: ¡Las cosas son muy interesantes aquí!

source: it’s you,
es_419: Eres tú,

source: your damaged body will now regenerate.
es_419: Tu cuerpo dañado se regenerará.

source: it was a hot topic.
es_419: Era un tema candente.

source: ...wh-who are you?
es_419: … ¿q-quién eres tú?

source: sir...?
es_419: ¿Señor…?

source: no, that was way too real for it to just be an illusion!
es_419: No, ¡era demasiado real para ser una ilusión!

source: please... kill... me...
es_419: Por favor… mátenme…

source: and now, we will be confiscating...
es_419: Así que ahora confiscaremos…

source: you have slain the [god of classes].
es_419: Has matado al [Dios de las Clases].

source: goooooo!{j}rh
es_419: ¡Vamoooos!

source: shall we get going now?
es_419: ¿Nos vamos?

source: she can’t just attack on her ow--
es_419: No puede atacar por su cuen…

source: bahahahahaha!
es_419: ¡Ja, ja, ja, ja, ja, ja!

source: u-undies!
es_419: ¡C-Calzón!

source: I would become your weapon, sir.
es_419: me convertiría en su arma, señor.

source: let me get straight to the point.
es_419: Iré directamente al grano.

source: in my mind, this was a scene straight out of an action movie.
es_419: En mi mente, esta escena era salida de una película de acción.

source: I guess that means your parents are broke losers.
es_419: Supongo que tus padres deben ser unos pobres diablos.

source: each time you level up, you only get 5 ability points!
es_419: Cada vez que se sube de nivel, ¡se reciben 5 puntos de habilidad!

source: I, uhh, picked it up on the way here!
es_419: ehh, ¡la recogí de camino aquí!

source: b-boss?
es_419: ¿J-jefe?

source: please welcome our brave warrior!
es_419: ¡Demos la bienvenida a nuestro valiente guerrero!

source: I never wanted to lie to my fans!
es_419: ¡Nunca quise mentirles a mis fans!

source: spell invocation!
es_419: ¡Invoco un hechizo!

source: jn{j}those are clearly pros.
es_419: Claramente son pros.

source: at me?
es_419: ¿Conmigo?

source: I’m going to go play now. bye.{j}tm
es_419: Me voy a jugar. Adiós.

source: =10 million won
es_419: = 10 millones de wones

source: y-yes, that’s me, but...
es_419: S-sí, soy yo, pero…

source: hawkeye was actually the one who benefitted the most from this entire incident.
es_419: Hawkeye fue el que más se benefició con todo este incidente.

source: ...then I’ll just destroy the entire planet.
es_419: … entonces, destruiré todo el planeta.

source: that’s amazing!
es_419: ¡Es increíble!

source: ugh, whatever. this isn’t the only dungeon to farm anyway.
es_419: Agh, como sea. Esta no es la única mazmorra que hay para vaciar.

source: justice guild
es_419: Gremio de la Justicia

source: what’s all the fuss about?
es_419: ¿A qué se debe tanto alboroto?

source: lin... what?
es_419: Lin… ¿qué?

source: episode 3. 1 vs.{j}3,000,000
es_419: Episodio 1

source: of course I am.
es_419: Por supuesto que sí.

source: your payment is complete.
es_419: Se ha completado el pago.

source: my heart was racing. it was as if I had returned to my childhood.
es_419: Tenía el corazón acelerado. Era como volver a mi infancia.

source: did you practice killing monster mobs while I was gone?
es_419: ¿Practicaste matar monstruos mientras no estuve?

source: oh, hi.
es_419: Ah, hola.

source: me too.{j}su
es_419: ¡Y el mío!

source: rise
es_419: FRAS

source: I need more.
es_419: Necesito más.

source: we need justice!
es_419: ¡Necesitamos justicia!

source: four guardians, huh?
es_419: Cuatro guardianes, ¿eh?

source: you’re in danger right now!
es_419: ¡Está en peligro!

source: I remember even spending my weekends at the internet café with my friends just leveling up all day.
es_419: Recuerdo que hasta me pasaba los fines de semana con mis amigos en el cibercafé subiendo de nivel.

source: who cares?
es_419: ¿A quién le importa?

source: performer waiting room
es_419: Sala de espera para artistas

source: I...{j}I never wanted to lie in the first place!
es_419: Yo…{j}¡Yo jamás quise mentir!

source: wait, then who are all these men in suits?!
es_419: Espera, ¡¿quiénes son todos estos tipos con traje?!

source: the best virtual reality fantasy game out now!
es_419: ¡El mejor juego de fantasía para realidad virtual que hay!

source: you know undies?
es_419: ¿Conoces a Calzón?

source: if you’re late again, you’re dead meat.
es_419: Si llegas tarde otra vez, te mato.

source: a{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h
es_419: AAAAAAAAAH

source: I’m the man...
es_419: Soy el hombre…

source: whoa, me too!{j}ba
es_419: ¡Guau, el mío también!

source: Staff Jaehyun leeㆍRock leeㆍBobaccari KongsunaㆍWallabyㆍBalkwang beoseot
es_419: Equipo: Jaehyun leeㆍRock leeㆍBobaccari KongsunaㆍWallabyㆍBalkwang beoseot

source: that’s definitely not a user.
es_419: Definitivamente, no es un jugador.

source: she’s been first place on the charts!
es_419: ¡Sigue primera en el ranking!

source: it was a rough start.
es_419: Fue un comienzo difícil.

source: sip
es_419: GLU

source: ...stealing from the poor?
es_419: … robarles a los pobres?

source: who the hell spends over 100 million won on a game?
es_419: ¿Quién rayos gasta más de cien millones de wones en un juego?

source: I’m already dead, anyway.
es_419: De todos modos, ya estoy muerto.

source: is that what was troubling you, sir?!
es_419: ¡¿Eso es lo que le preocupa, señor?!

source: no, join our guild!
es_419: ¡No, únete al nuestro!

source: and you should never f*ck with someone who has nothing to lose.
es_419: Y nunca deberías c*garla con alguien que no tiene nada que perder.

source: approximately three million members
es_419: aproximadamente tres millones

source: the fastest way to grow stronger is...
es_419: La forma más rápida de hacerse más fuerte…

source: and that’s what happened.
es_419: Y eso fue lo que pasó.

source: I bet you’re a loser in real life too, huh?
es_419: Seguro que también eres un perdedor en la vida real, ¿no?

source: f*ck off.
es_419: Vete a la m*erda.

source: she’s been in first place for 13 weeks straight!
es_419: ¡Lleva 13 semanas seguidas en el primer puesto!

source: urus’ lost head urakan{j}lv.{j}999
es_419: La cabeza perdida de Urus URAKAN Nv. 999

source: beam
es_419: BRILLA
